import Mock from 'mockjs';


Mock.mock('/GetSearchList', 'post', {
  result: '1',
  "totalcount": 18,
	"rows": [{
			"ID": 2012,
      "PT_title": "（按压效果）这里是标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type1": "安徽",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
      "PT_title": "若文章标题涉及关键字，关键字",
			"PT_type1": "安徽1",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
      "PT_title": "若文章标题涉及关键字，关键字",
			"PT_type1": "安徽2",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
      "PT_title": "若文章标题涉及关键字，关键字",
			"PT_type1": "安徽3",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
      "PT_title": "若文章标题涉及关键字，关键字",
			"PT_type1": "安徽4",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type1": "安徽5",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type1": "安徽6",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽7",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽8",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽9",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		},{
			"ID": 2012,
			"PT_type1": "安徽10",
        "PT_title": "（按压效果）这里是文章标题，最多显示两行内 容，超出内容使用..超出内容使用..超出内容使用...",
			"PT_type2": "水利水电",
			"PT_type3": "农林牧渔专用仪器",
      "P_Img": "16小时前",
		}
    ]
});

Mock.mock('/GetfilterType', 'post', {
  result: '1',
  "totalcount": 3,
	"rows": [{
    "PT_key":1,
			"PT_type": "安徽测试",
		},
    {
      "PT_key":2,
    		"PT_type": "安徽测试",
    	},
      {
        "PT_key":3,
      		"PT_type": "安徽测试",
      	},
    ]
  });
